### Let's try some pandas-features with the housing dataset (Seattle)

In [130]:
import numpy as np
import pandas as pd

In [131]:
# load the data
df = pd.read_csv("houses.csv")

In [132]:
# get the first 5 rows
# for amount of data, try just df or len(df)
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.00,3,1.00,1180,5650,1.00,0,0,...,7,1180,0,1955,0,98178,47.51,-122.26,1340,5650
1,6414100192,20141209T000000,538000.00,3,2.25,2570,7242,2.00,0,0,...,7,2170,400,1951,1991,98125,47.72,-122.32,1690,7639
2,5631500400,20150225T000000,180000.00,2,1.00,770,10000,1.00,0,0,...,6,770,0,1933,0,98028,47.74,-122.23,2720,8062
3,2487200875,20141209T000000,604000.00,4,3.00,1960,5000,1.00,0,0,...,7,1050,910,1965,0,98136,47.52,-122.39,1360,5000
4,1954400510,20150218T000000,510000.00,3,2.00,1680,8080,1.00,0,0,...,8,1680,0,1987,0,98074,47.62,-122.05,1800,7503

**Filtering single rows from the data**

In [133]:
# filter out only one single house with a certain id
# this is mostly needed in ML when we have only a small amount of data
# (e.g. 500 - 1000 rows) and we want to preserve as much as data as possible
# => filter out the problematic individual rows with exact IDs
single_house = df[df['id'] == 3793500160]

In [134]:
# use transpose() to view in vertical format (only works with exactly one row)
single_house.transpose()

                             9
id                  3793500160
date           20150312T000000
price                323000.00
bedrooms                     3
bathrooms                 2.50
sqft_living               1890
sqft_lot                  6560
floors                    2.00
waterfront                   0
view                         0
condition                    3
grade                        7
sqft_above                1890
sqft_basement                0
yr_built                  2003
yr_renovated                 0
zipcode                  98038
lat                      47.37
long                   -122.03
sqft_living15             2390
sqft_lot15                7570

In [135]:
# a very practical way to filter individual houses => iloc
# this is a house with index number 13571
single_house = df.iloc[13571]
single_house.to_frame()

                         13571
id                  1026069061
date           20150129T000000
price                682000.00
bedrooms                     4
bathrooms                 2.50
sqft_living               3600
sqft_lot                203425
floors                    2.00
waterfront                   0
view                         0
condition                    3
grade                        9
sqft_above                3400
sqft_basement              200
yr_built                  1979
yr_renovated                 0
zipcode                  98077
lat                      47.76
long                   -122.02
sqft_living15             3150
sqft_lot15              202989

**Finding a certain rows based on a condition (smallest, largest value etc.)**

In [136]:
# finding the most expensive house, get the row
most_expensive = df.loc[df['price'].idxmax()]

# print the whole most_expensive for all info
# most_expensive
most_expensive['id']

np.int64(6762700020)

In [137]:
# finding the most expensive house, get the row
cheapest_house = df.loc[df['price'].idxmin()]
cheapest_house

id                    3421079032
date             20150217T000000
price                   75000.00
bedrooms                       1
bathrooms                   0.00
sqft_living                  670
sqft_lot                   43377
floors                      1.00
waterfront                     0
view                           0
condition                      3
grade                          3
sqft_above                   670
sqft_basement                  0
yr_built                    1966
yr_renovated                   0
zipcode                    98022
lat                        47.26
long                     -121.91
sqft_living15               1160
sqft_lot15                 42882
Name: 1149, dtype: object

**Recommended approach: nlargest() and nsmallest()**

In [138]:
# get the 5 most expensive houses by price
df.nlargest(5, "price")

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
7252,6762700020,20141013T000000,7700000.00,6,8.00,12050,27600,2.50,0,3,...,13,8570,3480,1910,1987,98102,47.63,-122.32,3940,8800
3914,9808700762,20140611T000000,7062500.00,5,4.50,10040,37325,2.00,1,2,...,11,7680,2360,1940,2001,98004,47.65,-122.21,3930,25449
9254,9208900037,20140919T000000,6885000.00,6,7.75,9890,31374,2.00,0,4,...,13,8860,1030,2001,0,98039,47.63,-122.24,4540,42730
4411,2470100110,20140804T000000,5570000.00,5,5.75,9200,35069,2.00,0,0,...,13,6200,3000,2001,0,98039,47.63,-122.23,3560,24345
1448,8907500070,20150413T000000,5350000.00,5,5.00,8000,23985,2.00,0,4,...,12,6720,1280,2009,0,98004,47.62,-122.22,4600,21750

In [139]:
# get the 5 most expensive houses by price
df.nsmallest(5, "price")

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
1149,3421079032,20150217T000000,75000.00,1,0.00,670,43377,1.00,0,0,...,3,670,0,1966,0,98022,47.26,-121.91,1160,42882
15293,40000362,20140506T000000,78000.00,2,1.00,780,16344,1.00,0,0,...,5,780,0,1942,0,98168,47.47,-122.28,1700,10387
465,8658300340,20140523T000000,80000.00,1,0.75,430,5050,1.00,0,0,...,4,430,0,1912,0,98014,47.65,-121.91,1200,7500
16198,3028200080,20150324T000000,81000.00,2,1.00,730,9975,1.00,0,0,...,5,730,0,1943,0,98168,47.48,-122.31,860,9000
8274,3883800011,20141105T000000,82000.00,3,1.00,860,10426,1.00,0,0,...,6,860,0,1954,0,98146,47.50,-122.34,1140,11250

In [140]:
# get the 5 most expensive houses by price
df.nlargest(5, "sqft_living")

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
12777,1225069038,20140505T000000,2280000.00,7,8.00,13540,307752,3.00,0,4,...,12,9410,4130,1999,0,98053,47.67,-121.99,4850,217800
7252,6762700020,20141013T000000,7700000.00,6,8.00,12050,27600,2.50,0,3,...,13,8570,3480,1910,1987,98102,47.63,-122.32,3940,8800
3914,9808700762,20140611T000000,7062500.00,5,4.50,10040,37325,2.00,1,2,...,11,7680,2360,1940,2001,98004,47.65,-122.21,3930,25449
9254,9208900037,20140919T000000,6885000.00,6,7.75,9890,31374,2.00,0,4,...,13,8860,1030,2001,0,98039,47.63,-122.24,4540,42730
8092,1924059029,20140617T000000,4668000.00,5,6.75,9640,13068,1.00,1,4,...,12,4820,4820,1983,2009,98040,47.56,-122.21,3270,10454

### Basic statistics helper functions

In [141]:
# mean / average
mean_price = df['price'].mean()
int(mean_price)

540088

In [142]:
# mean / average
mean_bedroom_amount = df['bedrooms'].mean()
mean_bedroom_amount

np.float64(3.37084162309721)

In [143]:
# min/max
smallest_price = df['price'].min()
largest_price = df['price'].max()

# print both
print(smallest_price, largest_price)

75000.0 7700000.0

### Easiest way to get all the basic statistics at once => describe()

In [144]:
# override the default scientific notation
# let's force a decimal format, you can control amount of decimals
# by replacing "%.2f" in the lambda
pd.set_option('display.float_format', lambda x: "%.2f" % x)

In [145]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00,21613.00
mean,4580301520.86,540088.14,3.37,2.11,2079.90,15106.97,1.49,0.01,0.23,3.41,7.66,1788.39,291.51,1971.01,84.40,98077.94,47.56,-122.21,1986.55,12768.46
std,2876565571.31,367127.20,0.93,0.77,918.44,41420.51,0.54,0.09,0.77,0.65,1.18,828.09,442.58,29.37,401.68,53.51,0.14,0.14,685.39,27304.18
min,1000102.00,75000.00,0.00,0.00,290.00,520.00,1.00,0.00,0.00,1.00,1.00,290.00,0.00,1900.00,0.00,98001.00,47.16,-122.52,399.00,651.00
25%,2123049194.00,321950.00,3.00,1.75,1427.00,5040.00,1.00,0.00,0.00,3.00,7.00,1190.00,0.00,1951.00,0.00,98033.00,47.47,-122.33,1490.00,5100.00
50%,3904930410.00,450000.00,3.00,2.25,1910.00,7618.00,1.50,0.00,0.00,3.00,7.00,1560.00,0.00,1975.00,0.00,98065.00,47.57,-122.23,1840.00,7620.00
75%,7308900445.00,645000.00,4.00,2.50,2550.00,10688.00,2.00,0.00,0.00,4.00,8.00,2210.00,560.00,1997.00,0.00,98118.00,47.68,-122.12,2360.00,10083.00
max,9900000190.00,7700000.00,33.00,8.00,13540.00,1651359.00,3.50,1.00,4.00,5.00,13.00,9410.00,4820.00,2015.00,2015.00,98199.00,47.78,-121.31,6210.00,871200.00